{
  "()": 0,
  "((1, 1, 2, 0),)": 1,
  "((0, 1, 1, 0),)": 2,
  "((1, 1, 3, 0),)": 3,
  "((1, 5, 3, 1),)": 4,
  "((0, 1, 0, 0),)": 5,
  "((1, 0, 3, 1),)": 6,
  "((0, 4, 0, 1),)": 7,
  "((1, 0, 2, 0),)": 8,
  "((0, 0, 0, 1),)": 9,
  "((0, 0, 1, 0),)": 10,
  "((1, 6, 1, 0),)": 11,
  "((0, 7, 2, 0),)": 12,
  "((0, 1, 1, 0), (1, 1, 2, 0))": 13,
  "((0, 0, 1, 2),)": 14,
  "((1, 0, 2, 2),)": 15,
  "((0, 1, 2, 0),)": 16,
  "((1, 1, 1, 0),)": 17,
  "((1, 3, 3, 1),)": 18,
  "((0, 0, 0, 0),)": 19,
  "((0, 2, 0, 1),)": 20,
  "((1, 0, 3, 0),)": 21,
  "((1, 0, 1, 0),)": 22,
  "((0, 0, 2, 0),)": 23,
  "((1, 6, 2, 0),)": 24,
  "((0, 7, 1, 0),)": 25,
  "((0, 0, 0, 2),)": 26,
  "((1, 0, 3, 2),)": 27,
  "((0, 0, 1, 2), (1, 0, 2, 2))": 28,
  "((1, 7, 3, 0),)": 29,
  "((0, 0, 1, 0), (1, 0, 2, 0))": 30,
  "((0, 6, 0, 0),)": 31,
  "((1, 5, 3, 2),)": 32,
  "((0, 4, 0, 2),)": 33,
  "((1, 3, 3, 0),)": 34,
  "((0, 1, 2, 0), (1, 1, 3, 0))": 35,
  "((0, 0, 2, 2),)": 36,
  "((1, 0, 1, 2),)": 37,
  "((0, 2, 0, 0),)": 38,
  "((0, 1, 0, 0), (1, 1, 1, 0))": 39,
  "((0, 2, 0, 1), (1, 3, 3, 1))": 40,
  "((0, 4, 0, 1), (1, 5, 3, 1))": 41,
  "((1, 2, 1, 0),)": 42,
  "((0, 6, 0, 1), (1, 6, 1, 0))": 43,
  "((0, 7, 2, 0), (1, 7, 3, 1))": 44,
  "((1, 5, 2, 0),)": 45,
  "((0, 3, 2, 0),)": 46,
  "((0, 0, 0, 1), (1, 0, 3, 1))": 47,
  "((1, 8, 2, 0),)": 48,
  "((1, 8, 3, 1),)": 49,
  "((0, 4, 1, 0),)": 50,
  "((0, 1, 0, 0), (1, 1, 3, 0))": 51,
  "((0, 8, 0, 1),)": 52,
  "((0, 8, 1, 0),)": 53,
  "((0, 1, 1, 0), (1, 0, 2, 2))": 54,
  "((0, 0, 1, 2), (1, 1, 2, 0))": 55,
  "((0, 1, 1, 0), (1, 1, 3, 0))": 56,
  "((1, 0, 2, 1),)": 57,
  "((0, 1, 0, 0), (1, 1, 2, 0))": 58,
  "((1, 0, 3, 1), (1, 0, 3, 2))": 59,
  "((0, 0, 1, 1),)": 60,
  "((0, 0, 2, 2), (1, 0, 3, 2))": 61,
  "((0, 0, 0, 2), (1, 0, 1, 2))": 62,
  "((0, 1, 1, 0), (1, 0, 2, 0))": 63,
  "((0, 3, 3, 0), (1, 3, 3, 1))": 64,
  "((0, 2, 0, 1), (1, 2, 0, 0))": 65,
  "((1, 2, 2, 0),)": 66,
  "((0, 0, 0, 1), (0, 0, 0, 2))": 67,
  "((0, 0, 1, 0), (1, 1, 2, 0))": 68,
  "((0, 0, 2, 0), (1, 0, 3, 0))": 69,
  "((0, 6, 0, 0), (1, 7, 3, 0))": 70,
  "((0, 3, 1, 0),)": 71,
  "((1, 7, 3, 1),)": 72,
  "((0, 0, 0, 0), (1, 0, 1, 0))": 73,
  "((1, 1, 3, 1),)": 74,
  "((0, 6, 0, 1),)": 75,
  "((1, 5, 3, 0),)": 76,
  "((0, 0, 0, 1), (1, 1, 2, 0))": 77,
  "((1, 5, 2, 2),)": 78,
  "((1, 8, 3, 2),)": 79,
  "((0, 1, 1, 0), (1, 0, 3, 1))": 80,
  "((0, 4, 0, 0),)": 81,
  "((1, 1, 3, 0), (1, 1, 3, 1))": 82,
  "((0, 1, 0, 1),)": 83,
  "((0, 4, 0, 2), (1, 5, 3, 2))": 84,
  "((0, 1, 2, 0), (1, 1, 1, 0))": 85,
  "((0, 4, 1, 2),)": 86,
  "((0, 1, 0, 0), (0, 1, 0, 1))": 87,
  "((0, 8, 0, 2),)": 88,
  "((1, 8, 2, 2),)": 89,
  "((1, 6, 0, 0),)": 90,
  "((0, 8, 1, 2),)": 91,
  "((1, 2, 0, 1),)": 92,
  "((1, 8, 3, 0),)": 93,
  "((1, 8, 1, 0),)": 94,
  "((0, 4, 0, 1), (1, 6, 2, 0))": 95,
  "((0, 1, 1, 0), (1, 5, 3, 1))": 96,
  "((1, 4, 1, 2),)": 97,
  "((0, 8, 0, 0),)": 98,
  "((0, 7, 1, 0), (1, 5, 3, 1))": 99,
  "((0, 5, 2, 2),)": 100,
  "((0, 0, 1, 2), (1, 5, 3, 1))": 101,
  "((1, 1, 0, 0),)": 102,
  "((0, 4, 0, 1), (1, 4, 1, 2))": 103,
  "((0, 5, 2, 2), (1, 5, 3, 1))": 104,
  "((0, 4, 0, 1), (1, 1, 2, 0))": 105,
  "((0, 0, 0, 2), (1, 0, 3, 2))": 106,
  "((0, 4, 0, 1), (1, 0, 2, 2))": 107,
  "((0, 0, 0, 2), (1, 6, 1, 0))": 108,
  "((0, 0, 0, 0), (1, 0, 3, 0))": 109,
  "((0, 8, 2, 0),)": 110,
  "((0, 3, 3, 1),)": 111,
  "((0, 1, 0, 1), (1, 6, 1, 0))": 112,
  "((0, 7, 2, 0), (1, 0, 3, 2))": 113,
  "((0, 7, 2, 0), (1, 1, 3, 1))": 114,
  "((1, 3, 2, 0),)": 115,
  "((0, 7, 3, 0),)": 116,
  "((0, 4, 0, 2), (1, 6, 1, 0))": 117,
  "((1, 1, 0, 0), (1, 1, 0, 0))": 118,
  "((0, 6, 0, 0), (1, 6, 2, 0))": 119,
  "((0, 7, 2, 0), (1, 5, 3, 2))": 120,
  "((0, 2, 1, 0),)": 121,
  "((0, 8, 1, 2), (1, 8, 2, 2))": 122,
  "((0, 7, 1, 0), (1, 7, 3, 0))": 123,
  "((0, 0, 1, 2), (1, 0, 3, 2))": 124,
  "((0, 1, 0, 0), (1, 0, 1, 2))": 125,
  "((0, 0, 0, 2), (1, 0, 2, 2))": 126,
  "((1, 5, 2, 0), (1, 5, 3, 1))": 127,
  "((0, 0, 0, 2), (1, 1, 1, 0))": 128,
  "((0, 0, 0, 0), (1, 0, 2, 0))": 129,
  "((0, 0, 1, 0), (1, 0, 3, 0))": 130,
  "((1, 5, 1, 0),)": 131,
  "((0, 1, 2, 0), (1, 0, 3, 2))": 132,
  "((0, 0, 2, 2), (1, 1, 3, 0))": 133,
  "((1, 7, 2, 0),)": 134,
  "((1, 4, 2, 2),)": 135,
  "((0, 0, 0, 1), (1, 6, 1, 0))": 136,
  "((0, 1, 0, 0), (1, 0, 1, 0))": 137,
  "((0, 4, 2, 0),)": 138,
  "((1, 6, 3, 1),)": 139,
  "((0, 4, 0, 1), (0, 4, 1, 0))": 140,
  "((0, 0, 2, 0), (1, 1, 3, 0))": 141,
  "((1, 6, 2, 0), (1, 6, 3, 1))": 142,
  "((0, 0, 0, 1), (1, 1, 1, 0))": 143,
  "((0, 6, 1, 0),)": 144,
  "((0, 5, 1, 2),)": 145,
  "((0, 1, 2, 0), (1, 0, 3, 1))": 146,
  "((0, 7, 0, 0),)": 147,
  "((0, 1, 0, 0), (1, 0, 2, 2))": 148,
  "((0, 1, 0, 0), (1, 0, 2, 0))": 149,
  "((0, 0, 1, 2), (1, 1, 3, 0))": 150,
  "((0, 0, 0, 2), (1, 1, 2, 0))": 151,
  "((0, 0, 1, 0), (1, 1, 3, 0))": 152,
  "((0, 5, 2, 0),)": 153,
  "((1, 5, 2, 1),)": 154,
  "((1, 2, 3, 1),)": 155,
  "((1, 2, 1, 1),)": 156,
  "((1, 4, 1, 0),)": 157,
  "((0, 1, 1, 0), (1, 0, 3, 2))": 158,
  "((1, 0, 0, 0),)": 159,
  "((0, 1, 1, 0), (1, 0, 3, 0))": 160,
  "((0, 8, 1, 0), (1, 8, 2, 0))": 161,
  "((0, 0, 0, 0), (1, 1, 1, 0))": 162,
  "((0, 7, 2, 0), (1, 0, 3, 1))": 163,
  "((0, 7, 0, 1), (0, 7, 1, 0))": 164,
  "((0, 5, 0, 1),)": 165,
  "((0, 3, 2, 1),)": 166,
  "((0, 0, 1, 2), (1, 6, 2, 0))": 167,
  "((0, 4, 1, 1),)": 168,
  "((0, 7, 0, 1),)": 169,
  "((0, 1, 2, 0), (1, 0, 3, 0))": 170,
  "((1, 2, 0, 0),)": 171,
  "((0, 0, 2, 0), (1, 0, 1, 0))": 172,
  "((0, 3, 0, 1),)": 173,
  "((1, 4, 3, 1),)": 174,
  "((0, 7, 1, 0), (1, 0, 2, 2))": 175,
  "((0, 7, 2, 0), (1, 7, 3, 0))": 176,
  "((1, 6, 0, 1),)": 177,
  "((0, 4, 0, 1), (1, 7, 3, 0))": 178,
  "((0, 6, 0, 0), (1, 5, 3, 1))": 179,
  "((0, 6, 0, 0), (1, 6, 1, 0))": 180,
  "((0, 7, 3, 0), (1, 5, 3, 2))": 181,
  "((0, 0, 0, 0), (0, 0, 0, 1))": 182,
  "((1, 4, 2, 0),)": 183,
  "((1, 0, 3, 0), (1, 0, 3, 1))": 184,
  "((0, 3, 1, 0), (1, 2, 2, 1))": 185,
  "((0, 7, 1, 0), (1, 4, 2, 2))": 186,
  "((0, 5, 1, 0),)": 187,
  "((0, 0, 0, 0), (1, 1, 2, 0))": 188,
  "((0, 0, 0, 1), (1, 6, 2, 0))": 189,
  "((0, 0, 0, 1), (1, 0, 1, 1))": 190,
  "((0, 5, 1, 2), (1, 6, 2, 0))": 191,
  "((0, 0, 2, 1), (1, 0, 3, 1))": 192,
  "((0, 6, 0, 0), (1, 5, 3, 2))": 193,
  "((0, 7, 1, 0), (1, 0, 3, 1))": 194,
  "((0, 4, 0, 2), (1, 6, 0, 0))": 195,
  "((0, 4, 0, 2), (1, 7, 3, 0))": 196,
  "((0, 2, 0, 0), (1, 3, 3, 0))": 197,
  "((0, 1, 1, 0), (1, 5, 3, 2))": 198,
  "((0, 0, 0, 1), (1, 1, 3, 0))": 199,
  "((0, 3, 3, 0),)": 200,
  "((0, 1, 0, 0), (1, 0, 3, 1))": 201,
  "((0, 3, 0, 1), (1, 2, 3, 1))": 202,
  "((0, 1, 1, 0), (0, 1, 1, 1))": 203,
  "((1, 1, 2, 0), (1, 1, 2, 1))": 204,
  "((0, 7, 2, 0), (1, 5, 2, 2))": 205,
  "((0, 7, 3, 1),)": 206,
  "((0, 0, 2, 1),)": 207,
  "((1, 6, 1, 2),)": 208,
  "((0, 5, 0, 0),)": 209,
  "((1, 2, 2, 1),)": 210,
  "((0, 0, 1, 1), (1, 0, 2, 1))": 211,
  "((0, 5, 0, 1), (1, 5, 1, 0))": 212,
  "((1, 8, 1, 2),)": 213,
  "((1, 4, 3, 0),)": 214,
  "((0, 8, 2, 2),)": 215,
  "((0, 4, 0, 2), (1, 1, 2, 0))": 216,
  "((0, 6, 0, 1), (1, 6, 2, 0))": 217,
  "((0, 3, 1, 1),)": 218,
  "((0, 4, 2, 0), (1, 4, 3, 1))": 219,
  "((0, 0, 1, 1), (0, 0, 1, 2))": 220,
  "((0, 0, 2, 2), (1, 0, 3, 1))": 221,
  "((0, 1, 0, 0), (1, 0, 3, 2))": 222,
  "((0, 7, 1, 0), (1, 7, 3, 1))": 223,
  "((0, 8, 0, 1), (1, 8, 3, 1))": 224,
  "((1, 0, 1, 1),)": 225,
  "((1, 6, 1, 0), (1, 6, 2, 1))": 226,
  "((1, 0, 2, 1), (1, 0, 2, 2))": 227,
  "((0, 0, 0, 1), (1, 0, 1, 2))": 228,
  "((1, 4, 0, 1),)": 229,
  "((1, 6, 3, 0),)": 230,
  "((0, 0, 1, 2), (1, 0, 3, 1))": 231,
  "((0, 4, 0, 1), (1, 4, 2, 2))": 232,
  "((0, 4, 1, 2), (1, 6, 1, 0))": 233,
  "((1, 5, 0, 0),)": 234,
  "((0, 7, 2, 2),)": 235,
  "((0, 0, 0, 2), (1, 1, 3, 0))": 236,
  "((0, 3, 2, 0), (1, 3, 3, 1))": 237,
  "((0, 1, 0, 0), (1, 5, 3, 1))": 238,
  "((0, 4, 0, 1), (1, 1, 3, 0))": 239,
  "((0, 5, 1, 2), (1, 5, 3, 1))": 240,
  "((0, 1, 0, 0), (0, 1, 0, 1), (1, 1, 3, 0), (1, 1, 3, 1))": 241,
  "((0, 2, 0, 1), (1, 2, 1, 0))": 242,
  "((0, 7, 1, 0), (1, 1, 3, 0))": 243,
  "((1, 3, 2, 0), (1, 3, 3, 0))": 244,
  "((1, 3, 3, 2),)": 245,
  "((1, 6, 1, 1),)": 246,
  "((0, 1, 0, 0), (1, 6, 2, 0))": 247,
  "((0, 4, 0, 1), (1, 7, 3, 1))": 248,
  "((0, 4, 0, 0), (1, 5, 3, 0))": 249,
  "((0, 1, 1, 0), (1, 3, 3, 1))": 250,
  "((0, 0, 0, 1), (1, 0, 2, 0))": 251,
  "((1, 2, 1, 0), (1, 2, 2, 0))": 252,
  "((0, 2, 0, 1), (1, 1, 2, 0))": 253,
  "((0, 7, 2, 0), (1, 3, 3, 1))": 254,
  "((0, 2, 0, 1), (1, 2, 2, 0))": 255,
  "((0, 4, 0, 2), (1, 2, 0, 0))": 256,
  "((0, 5, 1, 2), (1, 5, 3, 2))": 257,
  "((0, 0, 0, 1), (1, 0, 2, 2))": 258,
  "((1, 8, 2, 1),)": 259,
  "((0, 2, 0, 0), (1, 3, 3, 1))": 260,
  "((0, 4, 0, 2), (1, 6, 2, 0))": 261,
  "((0, 7, 1, 1), (0, 7, 2, 0))": 262,
  "((1, 2, 1, 2),)": 263,
  "((1, 3, 2, 1),)": 264,
  "((0, 5, 3, 1),)": 265,
  "((0, 8, 1, 1),)": 266,
  "((0, 6, 0, 1), (1, 5, 3, 1))": 267,
  "((0, 3, 1, 0), (1, 3, 3, 1))": 268,
  "((0, 4, 0, 2), (1, 4, 2, 2))": 269,
  "((1, 4, 2, 1),)": 270,
  "((1, 8, 0, 0),)": 271,
  "((0, 7, 1, 0), (1, 3, 3, 1))": 272,
  "((0, 2, 0, 1), (1, 6, 1, 0))": 273,
  "((0, 5, 2, 1),)": 274,
  "((0, 8, 0, 2), (1, 8, 3, 2))": 275,
  "((0, 3, 3, 0), (1, 5, 3, 2))": 276,
  "((0, 6, 0, 1), (1, 5, 2, 0))": 277,
  "((0, 0, 0, 2), (1, 6, 2, 0))": 278,
  "((1, 4, 0, 2),)": 279,
  "((0, 7, 1, 0), (1, 6, 2, 0))": 280
}